BAS BMEKZU Project/src/Catalogs/ИНАГРО_БазаРаспределения/ИНАГРО_БазаРаспределения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_БазаРаспределения</name>
  <attributes>
    <name>СпособРаспределенияЗатрат</name>
    <type>
      <types>EnumRef.ИНАГРО_СпособыРаспределенияЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиЗатрат</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Enums/ИНАГРО_СпособыРаспределенияЗатрат/ИНАГРО_СпособыРаспределенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_СпособыРаспределенияЗатрат</name>
  <enumValues>
    <name>ПропорциональноКоличествуВыпускаГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноПлощадиПолей</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноПрямойЗатрате</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноСуммеВыпускаГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноЗатратамПоВыпуску</name>
  </enumValues>
  <enumValues>
    <name>ОпределениеСтоимостиБиологическихАктивов</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_БазаРаспределения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРаспределенияЗатратПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект; 	

	ПропорциональноПрямойЗатрате = Объект.СпособРаспределенияЗатрат = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыРаспределенияЗатрат.ПропорциональноПрямойЗатрате");
	
	Элементы.СтатьиЗатрат.Доступность = ПропорциональноПрямойЗатрате;

КонецПроцедуры

#КонецОбласти
